<template>
    <el-container class="-container">
        <el-header class="terms-header">Artgallery用户协议</el-header>
        <el-main class="terms-main">
            <p>感谢您使用Artgallery。我们致力于给您提供舒适的服务。</p>
            <h2>个人信息</h2>
            <p>在本条款中，“个人信息”指的是任何可以用来联系或者识别一个人的信息。
                当您注册artgallery帐号或者使用其他特定的artgallery服务时，
                您会被要求填写您的“个人信息”。这里面的“个人信息”包括但不限于您的姓名、
                用户名、邮件地址、联系方式等。您可以选择不向我们提供这些信息，但是这意味
                着您在注册artgallery帐号、使用artgallery服务的时候会受到一定的限制，我们也无法确保
                后续的服务全部的可用性。我们只有在遵循本条款或者征得您同意的前提上才会将您的个
                人信息授权给第三方使用。</p>
            <h2>附加信息</h2>    
            <p>除了您的个人信息以外，在使用我们服务的时候，您可能会提供一些附加信息，比如为了使用某些服务时填写的信息、在使用个人主页填写的信息，还包括您在与我们沟通时提供的信息，这些信息包括但不限于您的使用偏好和兴趣等。比如当您的偏好或者兴趣与您的姓名和联系方式一起的时候，我们可以用这些信息识别您的身份。但是单独来看，这些信息本身并不具有识别您身份的作用，也不会被严格的当成您的“个人信息”来看待。</p>
            <h2>日志信息</h2>
            <p>和其他的网络服务一样，我们的服务记录了一些特定的关于用户怎样访问和使用我们服务的日志信息。比如：访问来源IP、使用的操作系统和浏览器，设备和程序识别码，登录的时间和日期，来源网址和跳出页面，页面流点击资料，访问的页面，页面停留时间，搜索内容，交易信息，所在位置，跳出率和登录频率等。我们会用这些信息管理我们服务，为您和其他使用者更好的定制和优化服务。</p>        
            <h2>cookie</h2>
            <p>出于方便您使用我们服务的目的，我们会根据您的浏览器版本和设置使用cookie来存储日志或者其他的信息（比如登录信息），这样您就不用每一次登录我们的服务的时候都需要重新输入密码。cookie是保存在您的电脑或者设备上用来存储特定信息的文件，我们同时使用session和cookie来保存信息。session将会在您关闭浏览器后自动销毁，cookie则会一直保存在您的设备中直到被删除或者失效。大部分的浏览器都有禁用cookie的选项，但是禁用cookie可能会限制我们为您提供某些功能或者服务。本隐私政策中的cookie条款仅对artgallery相关服务生效，并不针对平台上其他的第三方服务。</p>
            <h2>我们对信息的使用</h2>
            <p>在我们在政策条款中描述的信息使用方式外，出于更好的管理和运营服务，更好的与您沟通，为您提供更好的产品功能的目的使用您的信息。我们可能还会将您的个人信息与我们掌握的其他用户信息进行聚合和比较，以便于通过量化、分析数据，提升我们的服务，比如，通过您和其他用户的使用反馈进行新的产品和功能的研发。我们也可能针对您个人使用这些整合的信息，比如，通过您的使用反馈和兴趣爱好向您推荐艺术家、作品或者其他产品服务。</p>
            <h2>互动交流</h2>
            <p>出于某些目的，我们可能通过私信或者电子邮件与您沟通，比如与您沟通关于您的帐号状态、服务查询和购买需求。如果我们通过邮件、电话或者其他方法沟通，我们可能会记录沟通的内容。我们同样会邮件您以推荐作品、产品和其他服务，或者向您提供关于我们服务的通知，比如，向您提供artgallery的新功能或者功能优化。如果您不希望收到我们的推广信息，您可以根据邮件中的链接调整帐号设置，我们仍然会向您发送包括交易信息，artgallery产品动态和用户协议和隐私条款的更新在内的必要的通知邮件。</p>
        </el-main>
        <el-footer class="terms-footer">
            ©2019 <router-link :to="{name: 'Home'}">artgallery.com</router-link>
        </el-footer>
    </el-container>
</template>

<script>
export default {
    name: 'Terms'
}
</script>

<style scoped>
.terms-container {
    background-color:honeydew;
}
.terms-header {
    text-align: center;
    font-size: 60px;
    margin: 50px 0px 0px 0px;
    color: black;
}
.terms-main {
    border: thin solid black;
    margin: 100px 300px;
    background-color: white;
}
.terms-footer {
    text-align: center;
}
</style>
